app/controllers/authentications_controller.rb

  def destroy
    current_user.update_attributes(provider: nil, uid: nil)
---
UPDATE "users" SET "provider" = $1, "uid" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["provider", nil], ["uid", nil], ["updated_at", "2017-08-07 16:27:32.948768"], ["id", 3]]