app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 ORDER BY "orders"."id" ASC  [["user_id", 1]]
---
  def index
    @orders = current_user.orders.order(:id)

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "orders" ("user_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["product_id", 2], ["created_at", "2017-07-25 21:15:07.568866"], ["updated_at", "2017-07-25 21:15:07.568866"]]
---
  def create
    @user = current_user
    @product = Product.find(params[:product])
    @order = @user.orders.build({product: @product})
    respond_to do |format|
      if @order.save

SELECT  "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 25], ["LIMIT", 1]]
UPDATE "orders" SET "qty" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["qty", 2], ["updated_at", "2017-08-02 21:43:46.917754"], ["id", 25]]
---
  def update
    @order = current_user.orders.find(params[:id])
    current_qty = @order.qty
    @order.attributes = {qty: order_params[:qty]}
    respond_to do |format|
      if @order.save

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND (fulfilled = 'f')  [["user_id", 1]]
---
  def cart
    @orders = Order.get_active_users_cart(current_user)
    p @orders
    @errors = []
    @invalid_orders = []
    @orders.each do |order|

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND (fulfilled = 'f')  [["user_id", 1]]
UPDATE "orders" SET "shipment_id" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["shipment_id", 8], ["updated_at", "2017-08-16 18:21:34.233382"], ["id", 81]]
---
  def purchase
    # make api call to 3rd party vendor.  If successfull update status of fulfilled else return errors

    @orders = Order.get_active_users_cart(current_user)
    @errors = []
    @invalid_orders = []
    @amount = 0

    #check for quantity errors and update charge amount
    @orders.each do |order|
      order.order_qty_is_available
      if order.errors.any?
        @errors.push(order.errors.messages.values.join('. '))

UPDATE "users" SET "stripe_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["stripe_id", "cus_BDxFFw43bDAJeS"], ["updated_at", "2017-08-16 17:29:40.880410"], ["id", 5]]
---
          :email => params[:stripeEmail],
          :source  => params[:stripeToken]
        )
        current_user.update(stripe_id: customer.id)

UPDATE "products" SET "stock" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["stock", 48], ["updated_at", "2017-08-03 22:29:25.814259"], ["id", 4]]
INSERT INTO "shipments" ("created_at", "updated_at", "address") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2017-08-16 18:05:49.237794"], ["updated_at", "2017-08-16 18:05:49.237794"], ["address", "talal@sbcglobal.net \n\n     \n ,  "]]
---
        if charge.paid
          p "in paid"
          @orders.update_all({fulfilled: true, purchase: charge.id})
          Product.update_product_qty(@orders)
          @shipment = Shipment.create(address: getAddress)

DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 26]]
---
  def destroy

    respond_to do |format|
      if @order.destroy