app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    product_list = Product.all