app/controllers/reviews_controller.rb

  def create
    review = @product.reviews.build(review_params)
    review.user = current_user;

    respond_to do |format|
      if review.save
---
INSERT INTO "reviews" ("rating", "body", "product_id", "user_id", "created_at", "updated_at", "title") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["rating", 3], ["body", "a body"], ["product_id", 1], ["user_id", 1], ["created_at", "2017-07-31 22:06:10.490694"], ["updated_at", "2017-07-31 22:06:10.490694"], ["title", "A title"]]